app/Modules/Account/Controllers/AccountController.php

SELECT *
FROM `users`
WHERE `users`.`id` = 1
SELECT *
FROM `payments`
WHERE `user_id` = 1
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `payments`
WHERE `user_id` = 1
---
    public function index()
    {
        $userModel = new UserModel();
        $paymentModel = new PaymentModel();

        // Load the form helper to make form_open() available in views.
        helper('form');

        $userId = session()->get('userId'); // Assuming this is now handled by a filter or authentication system
        /** @var \App\Entities\User|null $user */
        $user = $userModel->find($userId);

        // Pass user data to the view.
        $data['user'] = $user;

        $data['pageTitle'] = 'My Account | Afrikenkid';
        $data['metaDescription'] = 'Manage your profile, view your account balance, and see your full transaction history.';
        $data['canonicalUrl'] = url_to('account.index');
        // Add noindex directive for authenticated pages
        $data['robotsTag'] = 'noindex, follow';

        // Retrieve paginated transactions for the user, ordered by creation date.
        // Displays 5 transactions per page.
        $data['transactions'] = $paymentModel->where('user_id', $userId)->orderBy('created_at', 'DESC')->paginate(5);