app/Modules/Gemini/Models/EntityModel.php

    public function findByUserAndKey(int $userId, string $entityKey): ?AGIEntity
    {
        /** @var \App\Modules\Gemini\Entities\AGIEntity|null $entity */
        return $this->where('user_id', $userId)
            ->where('entity_key', $entityKey)
            ->first();
---
SELECT *
FROM `entities`
WHERE `user_id` = 1
AND `entity_key` = 'hello'
 LIMIT 1