app/Modules/Auth/Libraries/AuthService.php

    public function authenticate(string $email, string $password): array
    {
        $user = $this->userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'nehemiahobati@gmail.com'
 LIMIT 1