app/Filters/BalanceFilter.php

SELECT *
FROM `users`
WHERE `users`.`id` = 1
---
    private function _getUser()
    {
        $userModel = new UserModel();
        /** @var \App\Entities\User|null $user */
        $user = $userModel->find(session()->get('userId'));