app/Controllers/HomeController.php

    public function index(): string
    {
        $userId = session()->get('userId');
        $user = null;
        $balance = '0.00';

        if ($userId) {
            /** @var \App\Entities\User|null $user */
            $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1