app/Models/UserModel.php

    public function getTotalBalance(): string
    {
        /** @var User|null $totalBalanceData */
        $totalBalanceData = $this->selectSum('balance')->first();
---
SELECT SUM(`balance`) AS `balance`
FROM `users`
 LIMIT 1

    public function deductBalance(int $userId, string $amount, bool $allowOverdraft = true): bool
    {
        $this->db->transStart();

        /** @var \App\Entities\User|null $user */
        $user = $this->find($userId);

        if (! $user) {
            $this->db->transRollback();
            return false;
        }

        $currentBalance = (string) ($user->balance ?? '0.00');
        $isSufficient = bccomp($currentBalance, $amount, 2) >= 0;

        if (! $isSufficient && ! $allowOverdraft) {
            $this->db->transRollback();
            return false;
        }

        // Perform deduction
        $user->balance = bcsub($currentBalance, $amount, 2);
        $this->save($user);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1
UPDATE `users` SET `balance` = '49.57', `updated_at` = '2026-03-23 23:49:21'
WHERE `users`.`id` IN ('1')

    public function addBalance(int $userId, string $amount): bool
    {
        $this->db->transStart();

        /** @var \App\Entities\User|null $user */
        $user = $this->find($userId);

        if (! $user) {
            $this->db->transRollback();
            return false;
        }

        $currentBalance = (string) ($user->balance ?? '0.00');
        $user->balance = bcadd($currentBalance, $amount, 2);
        $this->save($user);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1
UPDATE `users` SET `balance` = '50.00', `updated_at` = '2026-03-23 23:49:07'
WHERE `users`.`id` IN ('1')