app/Modules/Gemini/Libraries/GeminiService.php

SELECT *
FROM `users`
WHERE `users`.`id` = 1
---
    public function processInteraction(int $userId, string $prompt, array $uploadedFileIds, array $options): array
    {
        // 1. Prepare Files Internally
        $filesResult = $this->prepareUploadedFiles($uploadedFileIds, $userId);
        if (isset($filesResult['error'])) {
            return ['error' => $filesResult['error']];
        }
        $allParts = $filesResult['parts'];

        // 2. Context Setup
        $contextData = ['memoryService' => null, 'usedInteractionIds' => []];

        if ($options['assistant_mode'] ?? true) {
            $memoryService = service('memory', $userId);
            $contextData = $memoryService->buildContextualPrompt($prompt);

            if ($contextData['finalPrompt']) {
                array_unshift($allParts, ['text' => $contextData['finalPrompt']]);
            }
        } else {
            array_unshift($allParts, ['text' => $prompt]);
        }

        if (empty($allParts)) {
            return ['error' => 'No content provided.'];
        }

        // 3. Cost Estimation & Balance Check
        $estimate = $this->estimateCost($allParts);
        /** @var \App\Entities\User|null $user */
        $user = $this->userModel->find($userId);

SELECT *
FROM `user_settings`
WHERE `user_id` = 1
 LIMIT 1
---
    public function getUserSettings(int $userId)
    {
        return $this->userSettingsModel->where('user_id', $userId)->first();

SELECT *
FROM `prompts`
WHERE `user_id` = 1
---
    public function getUserPrompts(int $userId): array
    {
        return $this->promptModel->where('user_id', $userId)->findAll();