app/Modules/Gemini/Libraries/MediaGenerationService.php

    public function getActiveJob(int $userId): ?array
    {
        $job = $this->db->table('generated_media')
            ->where('user_id', $userId)
            ->where('status', 'pending')
            ->where('type', 'video')
            ->orderBy('created_at', 'DESC')
            ->get()
            ->getRowArray();
---
SELECT *
FROM `generated_media`
WHERE `user_id` = 1
AND `status` = 'pending'
AND `type` = 'video'
ORDER BY `created_at` DESC