app/Modules/Gemini/Libraries/MemoryService.php

    private function _updateEntitiesFromInteraction(array $keywords, string $interactionId): void
    {
        $isNovel = false;
        foreach ($keywords as $keyword) {
            $entityKey = strtolower($keyword);
            /** @var AGIEntity|null $entity */
            $entity = $this->entityModel->findByUserAndKey($this->userId, $entityKey);

            if (!$entity) {
                $isNovel = true;
                $entity = new AGIEntity([
                    'user_id' => $this->userId,
                    'entity_key' => $entityKey,
                    'name' => $keyword,
                    'relationships' => [],
                ]);
            }

            $entity->access_count = ($entity->access_count ?? 0) + 1;
            $entity->relevance_score = ($entity->relevance_score ?? $this->config->initialScore) + $this->config->rewardScore;

            $mentioned = $entity->mentioned_in ?? [];
            if (!in_array($interactionId, $mentioned)) {
                $mentioned[] = $interactionId;
            }
            $entity->mentioned_in = $mentioned;

            $this->entityModel->save($entity);
        }

        if ($isNovel) {
            $this->interactionModel
                ->where('unique_id', $interactionId)
                ->set('relevance_score', "relevance_score + {$this->config->noveltyBonus}", false)
                ->update();
---
INSERT INTO `entities` (`user_id`, `entity_key`, `name`, `relationships`, `access_count`, `relevance_score`, `mentioned_in`, `created_at`, `updated_at`) VALUES (1, 'hello', 'hello', '[]', 1, 1.5, '[\"int_69c1a75195b923.06463254\"]', '2026-03-23 23:49:21', '2026-03-23 23:49:21')
UPDATE `interactions` SET `relevance_score` = relevance_score + 0.3, `updated_at` = '2026-03-23 23:49:21'
WHERE `unique_id` = 'int_69c1a75195b923.06463254'

    private function _pruneMemory(): void
    {
        $count = $this->interactionModel->where('user_id', $this->userId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `interactions`
WHERE `user_id` = 1

    public function getRelevantContext(string $userInput): array
    {
        // Vector Search (Semantic)
        $semanticResults = [];
        $inputVector = $this->embeddingService->getEmbedding($userInput);
        if ($inputVector !== null) {
            /** @var \App\Modules\Gemini\Entities\Interaction[] $interactions */
            $interactions = $this->interactionModel->where('user_id', $this->userId)->where('embedding IS NOT NULL')->findAll();
            $similarities = [];
            foreach ($interactions as $interaction) {
                $emb = $interaction->embedding;
                if (is_array($emb)) {
                    $similarity = $this->_cosineSimilarity($inputVector, $emb);
                    $similarities[$interaction->unique_id] = $similarity;
                }
            }
            arsort($similarities);
            $semanticResults = array_slice($similarities, 0, $this->config->vectorSearchTopK, true);
        }

        // Keyword Search (Lexical)
        $inputEntities = $this->_extractEntities($userInput);
        $keywordResults = [];
        if (!empty($inputEntities)) {
            $entities = $this->entityModel->where('user_id', $this->userId)->whereIn('entity_key', $inputEntities)->findAll();
---
SELECT *
FROM `interactions`
WHERE `user_id` = 1
AND `embedding` IS NOT NULL
SELECT *
FROM `entities`
WHERE `user_id` = 1
AND `entity_key` IN ('hello')


        // Short-Term Memory (Force Recent Interactions)
        if ($this->config->forcedRecentInteractions > 0) {
            $recentInteractions = $this->interactionModel
                ->where('user_id', $this->userId)
                ->orderBy('id', 'DESC')
                ->limit($this->config->forcedRecentInteractions)
                ->findAll();
---
SELECT *
FROM `interactions`
WHERE `user_id` = 1
ORDER BY `id` DESC
 LIMIT 3

        if (!empty($relatedInteractionIds)) {
            $builder->whereNotIn('unique_id', $relatedInteractionIds);
        }
        $builder->set('relevance_score', "relevance_score - {$this->config->decayScore}", false)->update();
---
UPDATE `interactions` SET `relevance_score` = relevance_score - 0.05, `updated_at` = '2026-03-23 23:49:21'
WHERE `user_id` = 1