app/Modules/Admin/Controllers/AdminController.php

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $userModel = new UserModel();
        // Paginate users, displaying 10 per page.
        $data['users'] = $userModel->paginate(10);

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function show($id)
    {
        $userModel = new UserModel();
        /** @var \App\Entities\User|null $user */
        $user = $userModel->find($id);