app/Libraries/WalletService.php

    public function updateBalance(int $userId, float $amount, string $action): array
    {
        /** @var \App\Entities\User|null $user */
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1